import numpy as np

# Масив NumPy можна розділити на частини та присвоїти їм індекси. Принцип роботи схожий на те, як це відбувається зі списками Python.
a = np.array([1, 2, 3, 4, 5]) 
print(a[0])
print(a[1:])
print(a[:2])

# Індексація багатовимірного масиву NumPy може здійснюватись як і індексація звичайного списку списків у Python: елемент з i i-ого рядка та j j-ого стовця можна отримати вказавши ці індекси в окремих квадратних дужках m[i][j], або ж ми можемо використати кортеж цілих чисел m[i, j]

a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
print(a[1, 1])
print(a[1:, 1])
print(a[0, :2])


# Ми можемо створити масив NumPy, заповнений нулями, за допомогою функції np.zeros(). Першим аргументом ми передаємо кортеж розмірності масиву, а другим аргументом — тип даних.
b = np.zeros((3, 3), dtype="u4")
print(b)
