import numpy as np

# Розмірність матриці, як і векторів, можна подивитись за допомогою даного атрибуту shape. 

a = np.array([1, 2, 3, 4, 5], dtype=float)
print(a.shape)  # (5,)

# Як бачимо, це кортеж. Для вектора це кількість координат вектора, а для матриці перше значення кортежу — кількість рядків, а друге — кількість стовпців матриці. 

m = np.array([[1, 2, 3], [4, 5, 6]], dtype=int)
print(m.shape)  # (2, 3)

# Операції з матрицями будуть відбуватися таким самим чином, як і з вектором, оскільки це у нас масив масивів, окрім множення. Якщо ми будемо використовувати оператор ∗, то отримаємо поелементне множення всіх відповідних елементів двох матриць і можливо провести таку операцію лише для двох матриць однієї розмірності. Проте з точки зору лінійної алгебри множення двох матриць є дещо іншою операцією.

a = np.array([[2, 3, 4, 5],
              [1, 2, 3, 4]])

b = np.array([[2, 2, 2, 2],
              [1, 1, 1, 1]])

print(a*b)


# множення матриць відбувається за допомогою функції np.dot(), яка виконує скалярний добуток рядків першої матриці на стовпці другої матриці. В результаті ми отримаємо нову матрицю, яка буде мати розмірність (кількість рядків першої матриці, кількість стовпців другої матриці). Тобто якщо перша матриця має розмірність (m, n), а друга (n, p), то результатом буде матриця розмірності (m, p).

a = np.array([[1, 2, 3],
              [0, 1, 2]])

b = np.array([[ 1, 2],
              [ 0, 4],
              [-1, 0]])

c = np.dot(a, b)
print(c)