import numpy as np

# Скалярний добуток

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
print(a * b)  # [ 4 10 18] отримали не той результат, на який розраховували, оскільки ми виконали поелементне множення відповідних елементів і отримали новий вектор, а не скалярний добуток. Тому, що оператор ∗ відповідає поелементному множенню для двох векторів, чи у нашому випадку масивів ndarray, а щоб виконати скалярний добуток ми повинні виконати наступний скрипт:


a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
print(np.dot(a, b))  # 32  Ось тепер ми справді виконали скалярний добуток і отримали очікуваний результат.


# поелементне ділення

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
print(b / a)  # [4.  2.5 2. ] 
