import numpy as np

# Додавання та віднімання двох векторів. Дана операція можлива лише у тому випадку, якщо наші вектори однієї розмірності — тобто у них однакова к-сть елементів. Ми легко можемо дізнатись розмір нашого вектора за допомогою такої команди size:

a = np.array([1, 2, 3, 4, 5], dtype=float)
print(a.size)  # 5

# А коли ми додамо, чи віднімемо між собою два вектори, то у нас попарно віднімуться чи просумуються відповідні елементи наших векторів:

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
print(a + b)  # [5 7 9]
print(a - b)  # [-3 -3 -3]

